; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-31)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 room6 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 ball30 ball31 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(room room6)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(ball ball28)
(ball ball29)
(ball ball30)
(ball ball31)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 room3)
(at ball9 room3)
(at ball10 room3)
(at ball11 room3)
(at ball12 room3)
(at ball13 room4)
(at ball14 room4)
(at ball15 room4)
(at ball16 room4)
(at ball17 room4)
(at ball18 room4)
(at ball19 room4)
(at ball20 room4)
(at ball21 room4)
(at ball22 room4)
(at ball23 room5)
(at ball24 room5)
(at ball25 room5)
(at ball26 room5)
(at ball27 room5)
(at ball28 room6)
(at ball29 room6)
(at ball30 room6)
(at ball31 room6)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 room3)
(at ball9 room3)
(at ball10 room3)
(at ball11 room3)
(at ball12 room3)
(at ball13 room3)
(at ball14 room3)
(at ball15 room4)
(at ball16 room4)
(at ball17 room4)
(at ball18 room4)
(at ball19 room4)
(at ball20 room5)
(at ball21 room5)
(at ball22 room5)
(at ball23 room5)
(at ball24 room5)
(at ball25 room6)
(at ball26 room6)
(at ball27 room6)
(at ball28 room6)
(at ball29 room6)
(at ball30 room6)
(at ball31 room6)
)
)
)

; plan
1. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 22 of 31
2. (pick ball5 roomb left)
   deleted: (at ball5 roomb) (free left)
   added: (carry ball5 left)
   goals met: 22 of 31
3. (move roomb room6)
   deleted: (at-robby roomb)
   added: (at-robby room6)
   goals met: 22 of 31
4. (move room6 rooma)
   deleted: (at-robby room6)
   added: (at-robby rooma)
   goals met: 22 of 31
5. (drop ball5 rooma left)
   deleted: (carry ball5 left)
   added: (at ball5 rooma) (free left)
   goals met: 23 of 31
6. (move rooma room6)
   deleted: (at-robby rooma)
   added: (at-robby room6)
   goals met: 23 of 31
7. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 23 of 31
8. (pick ball27 room5 left)
   deleted: (at ball27 room5) (free left)
   added: (carry ball27 left)
   goals met: 23 of 31
9. (pick ball26 room5 right)
   deleted: (at ball26 room5) (free right)
   added: (carry ball26 right)
   goals met: 23 of 31
10. (move room5 room6)
   deleted: (at-robby room5)
   added: (at-robby room6)
   goals met: 23 of 31
11. (drop ball26 room6 right)
   deleted: (carry ball26 right)
   added: (at ball26 room6) (free right)
   goals met: 24 of 31
12. (drop ball27 room6 left)
   deleted: (carry ball27 left)
   added: (at ball27 room6) (free left)
   goals met: 25 of 31
13. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 25 of 31
14. (pick ball25 room5 left)
   deleted: (at ball25 room5) (free left)
   added: (carry ball25 left)
   goals met: 25 of 31
15. (move room5 room6)
   deleted: (at-robby room5)
   added: (at-robby room6)
   goals met: 25 of 31
16. (drop ball25 room6 left)
   deleted: (carry ball25 left)
   added: (at ball25 room6) (free left)
   goals met: 26 of 31
17. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 26 of 31
18. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 26 of 31
19. (pick ball22 room4 left)
   deleted: (at ball22 room4) (free left)
   added: (carry ball22 left)
   goals met: 26 of 31
20. (pick ball21 room4 right)
   deleted: (at ball21 room4) (free right)
   added: (carry ball21 right)
   goals met: 26 of 31
21. (move room4 room5)
   deleted: (at-robby room4)
   added: (at-robby room5)
   goals met: 26 of 31
22. (drop ball21 room5 right)
   deleted: (carry ball21 right)
   added: (at ball21 room5) (free right)
   goals met: 27 of 31
23. (drop ball22 room5 left)
   deleted: (carry ball22 left)
   added: (at ball22 room5) (free left)
   goals met: 28 of 31
24. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 28 of 31
25. (pick ball20 room4 left)
   deleted: (at ball20 room4) (free left)
   added: (carry ball20 left)
   goals met: 28 of 31
26. (pick ball14 room4 right)
   deleted: (at ball14 room4) (free right)
   added: (carry ball14 right)
   goals met: 28 of 31
27. (move room4 room5)
   deleted: (at-robby room4)
   added: (at-robby room5)
   goals met: 28 of 31
28. (drop ball20 room5 left)
   deleted: (carry ball20 left)
   added: (at ball20 room5) (free left)
   goals met: 29 of 31
29. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 29 of 31
30. (pick ball13 room4 left)
   deleted: (at ball13 room4) (free left)
   added: (carry ball13 left)
   goals met: 29 of 31
31. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 29 of 31
32. (drop ball14 room3 right)
   deleted: (carry ball14 right)
   added: (at ball14 room3) (free right)
   goals met: 30 of 31
33. (drop ball13 room3 left)
   deleted: (carry ball13 left)
   added: (at ball13 room3) (free left)
   goals met: 31 of 31
